[
  {"id":"lee2023","abstract":"Adaptation to changing environments is a universal feature of life and can involve the organism modifying itself in response to the environment as well as actively modifying the environment to control selection pressures. The latter case couples the organism to environment. Then, how quickly should the organism change in response to the environment? We formulate this question in terms of how memory duration scales with environmental rate of change when there are trade-offs in remembering vs. forgetting. We derive a universal scaling law for optimal memory duration, taking into account memory precision as well as two components of environmental volatility, bias and stability. We find sublinear scaling with any amount of environmental volatility. We use a memory complexity measure to explore the strategic conditions (game dynamics) favoring actively reducing environmental volatility—outsourcing memory through niche construction—over investing in neural tissue. We predict stabilizing niche construction will evolve when neural tissue is costly, the environment is variable, and it is beneficial to be able to encode a rich repertoire of environmental states.\nSignificance Statement All organisms must adapt to changing environments, but adaptation can modify the environment itself. We solve a version of this problem in terms of how long organisms remember. Shorter memory should be better for variable environments and longer for slow changing ones, but environmental variability depends on feedback. Surprisingly, we find the same mathematical law in both cases, revealing how much shorter memory should be relative to the environmental timescale. We consider how this depends on memory complexity and metabolic costs in populations, allowing us to predict a general set of conditions for when organism will outsource memory to the environment: when maintaining a brain is costly, the environment fluctuates quickly, and organisms inhabit a complex environment.","accessed":{"date-parts":[[2023,11,18]]},"author":[{"family":"Lee","given":"Edward D."},{"family":"Flack","given":"Jessica C."},{"family":"Krakauer","given":"David C."}],"citation-key":"lee2023","DOI":"10.1101/2022.09.01.506204","issued":{"date-parts":[[2023,1,8]]},"language":"en","license":"© 2023, Posted by Cold Spring Harbor Laboratory. This pre-print is available under a Creative Commons License (Attribution-NonCommercial-NoDerivs 4.0 International), CC BY-NC-ND 4.0, as described at http://creativecommons.org/licenses/by-nc-nd/4.0/","page":"2022.09.01.506204","publisher":"bioRxiv","section":"New Results","source":"bioRxiv","title":"🔥 Outsourcing Memory Through Niche Construction","type":"article","URL":"https://www.biorxiv.org/content/10.1101/2022.09.01.506204v2"},
  {"id":"sterelny2003","author":[{"family":"Sterelny","given":"Kim"}],"call-number":"BF698.95 .S74 2003","citation-key":"sterelny2003","event-place":"Malden, MA","ISBN":"978-0-631-18886-5 978-0-631-18887-2","issued":{"date-parts":[[2003]]},"number-of-pages":"262","publisher":"Blackwell","publisher-place":"Malden, MA","source":"Library of Congress ISBN","title":"Thought in a hostile world: the evolution of human cognition","title-short":"Thought in a hostile world","type":"book"}
]
